Revit 2024 API
DirectShapeReferenceOptions Properties
The DirectShapeReferenceOptions type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name associated with the reference object. The name does not need to be unique. The name must not be empty and must contain valid characters.
See Also
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace